[
  "Gaurav Kabra holds the position of Member of Technical Staff at Salesforce.",
  "Gaurav Kabra earned a B.Tech in Computer Science and Engineering from NIT Jaipur.",
  "Gaurav Kabra graduated with a CGPA of 9.57 in 2020.",
  "Gaurav Kabra served as an Associate Member of Technical Staff at Salesforce from June 2020 to April 2022.",
  "Gaurav Kabra was promoted to Member of Technical Staff at Salesforce in May 2022.",
  "Gaurav Kabra is based in Hyderabad, Telangana.",
  "Gaurav Kabra architected low-level component interaction designs for semantic search.",
  "Gaurav Kabra designed chunking and vector embedding integration for contextual responses.",
  "Gaurav Kabra developed end-to-end transactional logic for Salesforce's Intelligent Document Reader OCR solution.",
  "Gaurav Kabra applied atomicity principles to ensure all-or-none database operations.",
  "Gaurav Kabra resolved data inconsistencies under concurrent operations in the IDR system.",
  "Gaurav Kabra led technical discussions on high-level and low-level design for modular user experience components.",
  "Gaurav Kabra collaborated with cross-functional teams to align on extensibility and usability standards.",
  "Gaurav Kabra implemented invocable actions pluggable in Salesforce Flows.",
  "Gaurav Kabra implemented invocable actions usable in Apex within the Developer Console.",
  "Gaurav Kabra implemented invocable actions usable in OmniScript.",
  "Gaurav Kabra exposed invocable actions as REST endpoints.",
  "Gaurav Kabra improved the save performance of IDR templates by 31%.",
  "Gaurav Kabra improved the update performance of IDR templates by 31%.",
  "Gaurav Kabra developed scratch org support for the Intelligent Document Reader.",
  "Gaurav Kabra enabled new customers to trial IDR via scratch org implementation.",
  "Gaurav Kabra conducted a proof of concept using AWS Comprehend for key-phrase extraction.",
  "Gaurav Kabra conducted a proof of concept using AWS Textract for key-phrase extraction.",
  "Gaurav Kabra explored Apache Lucene in a POC to reduce dependency on AWS.",
  "Gaurav Kabra evaluated cost-cutting opportunities through Apache Lucene.",
  "Gaurav Kabra created recipes (ELT jobs) on the Salesforce CRM Analytics platform.",
  "Gaurav Kabra delivered a user interface for multi-target object support in IDR.",
  "Gaurav Kabra ensured the Intelligent Document Reader complied with European data residency requirements.",
  "Gaurav Kabra ensured the Intelligent Document Reader complied with Canadian data residency requirements.",
  "Gaurav Kabra ensured the Intelligent Document Reader complied with Australian data residency requirements.",
  "Gaurav Kabra implemented the First-Run Experience for the IDR user interface.",
  "Gaurav Kabra’s internship was as a Software Engineering Intern at Fidelity Investments in Chennai, TN.",
  "Gaurav Kabra developed a machine learning model with 92% accuracy to predict Oracle BI server health.",
  "Gaurav Kabra used K-Means clustering in his Fidelity Investments machine learning project.",
  "Gaurav Kabra used Support Vector Machines in his Fidelity Investments machine learning project.",
  "Gaurav Kabra used Decision Trees in his Fidelity Investments machine learning project.",
  "Gaurav Kabra used Random Forests in his Fidelity Investments machine learning project.",
  "Gaurav Kabra leveraged NumPy in his Fidelity Investments project.",
  "Gaurav Kabra leveraged Pandas in his Fidelity Investments project.",
  "Gaurav Kabra leveraged Matplotlib in his Fidelity Investments project.",
  "Gaurav Kabra leveraged Seaborn in his Fidelity Investments project.",
  "Gaurav Kabra leveraged the re module in his Fidelity Investments project.",
  "Gaurav Kabra leveraged Tkinter in his Fidelity Investments project.",
  "Gaurav Kabra leveraged Win32com.client in his Fidelity Investments project.",
  "Gaurav Kabra used Jupyter Notebook with a Conda environment during his Fidelity internship.",
  "Gaurav Kabra used PyCharm as his IDE during his Fidelity internship.",
  "Gaurav Kabra completed his Senior Secondary education at Shri Raghunath Sr. Sec. School, Laxmangarh with 97.60%.",
  "Gaurav Kabra completed his Secondary education at Shri Raghunath Sr. Sec. School, Laxmangarh with 96.33%.",
  "Gaurav Kabra authored the book 'The Alchemy Of JavaScript: Efficient Software Engineering In JavaScript'.",
  "Gaurav Kabra’s book is published and available on Amazon.",
  "Gaurav Kabra’s book is available on Google Books.",
  "Gaurav Kabra published a conference paper titled 'Style Transfer for Videos with Audio (Deep Learning)'.",
  "Gaurav Kabra’s conference paper appears on pages 607-617 of the proceedings.",
  "Gaurav Kabra’s conference paper was presented at the International Conference on Paradigms of Computing, Communication and Data Sciences.",
  "Gaurav Kabra’s personal website is kabragaurav.netlify.app.",
  "Gaurav Kabra’s phone number is +91-8209832252.",
  "Gaurav Kabra’s email address is gauravkabra.official@gmail.com.",
  "Gaurav Kabra’s LinkedIn profile is linkedin.com/in/gaurav-kabra.",
  "Gaurav Kabra’s GitHub profile is github.com/kabragaurav.",
  "Gaurav Kabra has solved over 800 problems on LeetCode.",
  "Gaurav Kabra’s LeetCode handle is leetcode.com/u/gauravkabra.",
  "Gaurav Kabra has earned all 6 problem-solving stars on HackerRank.",
  "Gaurav Kabra’s HackerRank profile is hackerrank.com/profile/GauravKabra.",
  "Gaurav Kabra has solved over 530 problems on GeeksforGeeks.",
  "Gaurav Kabra’s GeeksforGeeks profile is geeksforgeeks.org/user/gauravkabrageek.",
  "Gaurav Kabra’s programming languages include Java.",
  "Gaurav Kabra’s programming languages include JavaScript.",
  "Gaurav Kabra’s testing frameworks include JUnit.",
  "Gaurav Kabra’s testing frameworks include Jest.",
  "Gaurav Kabra’s testing frameworks include xUnit.",
  "Gaurav Kabra’s web development skills include HTML.",
  "Gaurav Kabra’s web development skills include CSS.",
  "Gaurav Kabra’s web development skills include Lightning Web Components.",
  "Gaurav Kabra’s relational database experience includes MySQL.",
  "Gaurav Kabra’s relational database experience includes PostgreSQL.",
  "Gaurav Kabra’s vector database experience includes ChromaDB.",
  "Gaurav Kabra’s vector database experience includes Milvus.",
  "Gaurav Kabra’s version control systems include Git.",
  "Gaurav Kabra’s version control systems include Perforce.",
  "Gaurav Kabra’s build tools include Bazel.",
  "Gaurav Kabra’s build tools include Maven.",
  "Gaurav Kabra’s build tools include Webpack.",
  "Gaurav Kabra’s technology stack includes Splunk.",
  "Gaurav Kabra’s technology stack includes AWS.",
  "Gaurav Kabra’s technology stack includes Heroku.",
  "Gaurav Kabra’s technology stack includes Spring.",
  "Gaurav Kabra’s technology stack includes Apache Spark.",
  "Gaurav Kabra’s technology stack includes Apache Kafka.",
  "Gaurav Kabra’s containerization tools include Docker.",
  "Gaurav Kabra’s containerization tools include Kubernetes.",
  "Gaurav Kabra’s other technical skills include C++.",
  "Gaurav Kabra’s other technical skills include ESLint.",
  "Gaurav Kabra’s other technical skills include Babel.",
  "Gaurav Kabra contributed to the Intelligent Document Reader product at Salesforce.",
  "Gaurav Kabra ensured data residency compliance for the IDR product.",
  "Gaurav Kabra improved system reliability through transactional design.",
  "Gaurav Kabra’s IDR architecture supports semantically rich search.",
  "Gaurav Kabra’s ELT recipes run on the CRM Analytics platform.",
  "Gaurav Kabra’s First-Run Experience guides users through IDR onboarding.",
  "Gaurav Kabra predicted BI server health status with machine learning models."
]
